Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

se = pd.Series(dtype=float,data=[4,8,15,16,23,42])
print(se)

0     4.0
1     8.0
2    15.0
3    16.0
4    23.0
5    42.0
dtype: float64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [10]:
lst = [1,2,3,4,5,6,7,8,9,10]
sr = pd.Series(lst)
sr

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

|Name | Age | Gender|
|:-:|:-:|:-:|
|Alice | 25| Female|
|Bob | 30| Male|
|Claire | 27| Female|

Then, print the DataFrame.

In [3]:
df = pd.DataFrame()

df['Name'] = ['Alice','Bob','Claire']
df['Age'] = [25,30,27]
df['Gender'] = ['Female','Male','Female']

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a 2-D, size mutable, heterogeneous tabular data structure. The data is stored in a tabular form in rows and columns.

In contrast with Series, it is a 1-D array capable of holding any kind of data

In [4]:
# Example of Dataframes

df1 = pd.DataFrame()
df1['name'] = ['gaurabh','harsh','jon','harry']
df1['semsester'] = [5,6,2,4]
df1['Final Marks'] = [87,69,74.3,61]

df1

      name  semsester  Final Marks
0  gaurabh          5         87.0
1    harsh          6         69.0
2      jon          2         74.3
3    harry          4         61.0

In [5]:
# Example of Series
ser = pd.Series(dtype=object)
ser['name'] = ['Harry','Subham','Krish','Arvind']
ser['Class'] = [5,6,8,4]
ser['Final Marks'] = [97,95,97,62]

print(ser)

name           [Harry, Subham, Krish, Arvind]
Class                            [5, 6, 8, 4]
Final Marks                  [97, 95, 97, 62]
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

1. df.head(3) -> It select the first 3 rows of the dataset
2. df.tail(3) -> It select the last 3 rows of the dataset
3. df.describe() -> It return the statistical data of the numerical attribute form the dataset
4. pd.Categorical() -> It returns the category of data for a particular column

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series and Dataframe are mutable in nature. Panels are deprecated in the further versions of python.
Hence to represent the 3-D data multiindexing in Dataframe is used instead of Panels

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [34]:
name = pd.Series(['Gaurabh', 'Krish', 'Suresh'])
sem = pd.Series([4, 6, 2])
marks = pd.Series([79, 86, 84])

df1 = pd.DataFrame(data={'Name': name, 'Semester': sem, 'Marks': marks})
df1

      Name  Semester  Marks
0  Gaurabh         4     79
1    Krish         6     86
2   Suresh         2     84